cpu-test.yaml
config:
  target: "http://35.216.52.91:8080"
  phases:
    # a load phase which lasts 60 seconds, where 5 new virtual users will be created every second
    - duration: 120
      arrivalRate: 5
      name: Warm up
      # rampTo: 10
scenarios:
  - name: just get hash
    flow:
      - get:
          url: "/hello"