io-test-3phases.yaml
config:
  target: "http://35.216.52.91:80"
  phases:
    # a load phase which lasts duration seconds, where arrivalRate new virtual users will be created every second
    - duration: 60
      arrivalRate: 3
      name: Warm up
    - duration: 120
      arrivalRate: 3
      rampTo: 50
      name: Ramp up load
    - duration: 9600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "data/ratings_test_10k.csv"
    fields:
      - "content"
scenarios:
  - name: just post content
    flow:
      - post:
          url: "/post"
          json:
            content: "{{ content }}"
      - think: 1
      - get:
          url: "/posts"