io-test.yaml
config:
  target: "http://35.216.52.91:80"
  phases:
    # a load phase which lasts duration seconds, where arrivalRate new virtual users will be created every second
    - duration: 333
      arrivalRate: 3
      name: Warm up
  payload:
    path: "ratings_test_1k.csv"
    fields:
      - "content"
scenarios:
  - name: just post content
    flow:
      - post:
          url: "/post"
          json:
            content: "{{ content }}"